[
  {
    "job_id": "7eacc912-7035-448c-b634-71f7ed9493fc",
    "title": "Quality Assurance Engineer",
    "company": "UW Health",
    "description_text": "Under the supervision and direction of the Manager, Web Technology in the Web Center, the Quality Assurance Engineer is responsible for developing and executing test plans and test cases, and the creation of tools to augment our software development and testing efforts. Specific duties and responsibilities include creating, maintaining, and executing test plans and test cases against our hardware and software platforms, estimating test efforts, analyzing and communicating test results, defect tracking and participating in day-to-day QA activities. This can also include the writing of specialized testing tools for use in testing our software platform. In addition, this position will ensure that technical specifications adhere to appropriate methodologies and principles when developing systems for web-based technologies, including, but not limited to the internet, extranet, and intranet for UW Health. The Quality Assurance Engineer must operate independently in handling a wide variety of situations. The position typically entails judgment in the development of solutions to major problems or opportunities where precedents are few. Successful performance requires technical skill in system design, analysis, and implementation of programs and web-based applications. In addition, the individual must have technical knowledge of testing and testability to influence better software design, promote proper engineering practice, bug prevention strategies, testability, accessibility, privacy, and other advanced quality concepts across products. A consultative role to other department and enterprise-wide staff is also necessary. This position will work closely with all members of the Web Center technical, creative and content teams, as well as with UW Health Information Systems networking, security and analysts responsible for web server technical support. A wide variety of internal and external relationships are involved to accomplish the objectives of performing the duties of this position. The incumbent will work in close coordination with UW Health Administration, Information Systems, and Marketing and Communications. Developing and maintaining good communication with these contacts is essential to accomplishing the objectives of this position and the goals of the Web Center. This position requires innovation and vision in problem solving and meeting objectives in a timely manner. Effective communication and organizational skills are critical to successful performance. All members of the Web Center must actively take a UW Health enterprise perspective and approach in their work to successfully achieve the goals of the Web Center, UW Health, and participating partners.",
    "location": "Not specified",
    "created_at": "2025-04-16T21:20:59.077862"
  }
]