[
  {
    "job_id": "5ecb33a6-c213-4cc8-96b5-4c096e88b8dd",
    "title": "",
    "company": "",
    "description_text": "UW HEALTH POSITION DESCRIPTION\nPOSITION SPECIFICS\n\nTitle:   Quality Assurance Engineer\nReports to: Manager, Web Technology\nJob Code: 320012\nManager Approval:  R.Broering        Date: 2/2016\n\nFLSA Status: Exempt\n\nDepartment/Number: Web Center/10220\n\nHR Approval:  MJG                      Date: 2/2016\n\nPOSITION SUMMARY\n\nUnder the supervision and direction of the Manager, Web Technology in the Web Center the Quality Assurance\nEngineer is responsible for developing and executing test plans and test cases, and the creation of tools to augment\nour software development and testing efforts. Specific duties and responsibilities include creating, maintaining and\nexecuting test plans and test cases against our hardware and software platforms, estimating test efforts, analyzing and\ncommunicating test results, defect tracking and participating in day to day QA Activities. This can also include the\nwriting of specialized testing tools for use in testing our software platform. In addition this position will ensure that\ntechnical specifications adhere to appropriate methodologies and principles when developing systems for web-based\ntechnologies, including, but not limited to the internet, extranet and intranet for UW Health.\n\nThe Quality Assurance Engineer must operate independently in handling a wide variety of situations. The position\ntypically entails judgment in the development of solutions to major problems or opportunities where precedents are\nfew. Successful performance requires technical skill in system design, analysis and implementation of programs and\nweb-based applications. In addition, the individual must have technical knowledge of testing and testability to influence\nbetter software design, promote proper engineering practice, bug prevention strategies, testability, accessibility,\nprivacy, and other advanced quality concepts across products. A consultative role to other department and enterprise-\nwide staff is also necessary. This position will work closely with all members of the Web Center technical, creative and\ncontent teams, as well as with UW Health Information Systems networking, security and analysts responsible for web\nserver technical support.\n\nA wide variety of internal and external relationships are involved to accomplish the objectives of performing the duties\nof this position. The incumbent will work in close coordination with UW Health Administration, Information Systems and\nMarketing and Communications. Developing and maintaining good communication with these contacts is essential to\naccomplishing the objectives of this position and the goals of the Web Center.\n\nThis position requires innovation and vision in problem solving and meeting objectives in a timely manner. Effective\ncommunication and organizational skills are critical to successful performance.\n\nAll members of the Web Center must actively take a UW Health enterprise perspective and approach in their work to\nsuccessfully achieve the goals of the Web Center, UW Health and participating partners.\n\nMAJOR RESPONSIBILITIES\n\nProvides application analysis, testing, design and debugging.\n\n1.  Develop and drive a high-level QA strategy, as well as take a hands-on approach to implementing that\n\nstrategy.\n\n2.  Lead efforts to develop, document, and implement applicable QA processes and procedures to provide\n\nmore effective quality methods within the group in support of providing quality products.\n\n3.  Create, implement, maintain, and enhance test plans, test scripts, and test methodologies that ensure\n\nexhaustive testing of all assigned software systems to ensure compliance with software/system\nspecifications.\n Develop software quality test plans and test cases, and lead in setting and maintaining the standards for\nSoftware Quality Assurance test documentation.\n\n4.\n\n5.  Be highly committed to create world class automation for regression and feature testing.\n6.  Design, implement, and maintain comprehensive test plans to ensure software requirements are met.\n7.  Collaborate with developers to improve overall product quality by emphasizing defect prevention\n\nthroughout the development process.\n\n8.  Maintain a high degree of error free programs, procedures, systems, and documentation on all software\n\napplication releases.\n\n9.  Anticipate potential software problems by creating exhaustive test scenarios that ensure comprehensive\n\ntesting.\n\n10.  Test web applications.\n\n\fUW HEALTH POSITION DESCRIPTION\n\n11.  Document all testing results in conjunction with test plans.\n12.  Identify and analyze defects/test results and be able to deduct the chain of events leading to a failure.\n13.  Identify areas for test improvement through analysis, experience and use of metrics.\n14.  Communicate critical issues and status updates in a timely manner.\n15.  Educate and train peers and subordinates on the QA process and provide guidance to them when they are\n\nunclear about the process.\n\n16.  Provide coaching and guidance to the Quality Assurance Team on “best practices”.\n17.  Plan, organize, and monitor the execution of the work assignments for the Quality Assurance Team.\n18.  Ensure that the project schedule is adhered to and the work is completed according to the schedule.\n19.   Participate in daily stand ups.\n20.  Manage processes for moving applications from test to production environments.\n21.  Develop and implement processes to manage the deployment of code to new clients.\n22.  Remain current on changes and new developments on new and existing software applications/releases\n\n(i.e., attending internal lunch and learns).\n\n23.  Establish and maintain good working relationships with peers in Development, Project Management, and\n\nwith internal and external clients.\n\nProvides application support/maintenance\n\n24.  Provide in-line documentation and overall support documentation where appropriate.\n25.  Assure existing systems are functioning properly and provide support where appropriate.\n26.  Enhance existing systems.\n27.  Provide on-call support for daily system operations. Respond to critical failures to the best ability. This may\n\ninclude researching the knowledge and skills of the staff to escalate necessary issues.\n28.  Assist in providing on-going user education for enhancements to existing applications.\n\nInteract with internal and external contacts\n\n1.  Consult regularly with information architect, graphic and content teams within the Web Center. Consult\nwith UW Health Information Systems staff to verify that additional software and web applications will be\ncompatible with requirements.\n\n2.  Work with software vendor’s directly when appropriate\n\nAll duties and requirements must be performed consistent with the UW Health Performance\nStandards.\n\nEducation\n\nMinimum\nPreferred\n\nWork Experience\n\nMinimum\n\nPOSITION REQUIREMENTS\nA Bachelor degree in a web development related field or equivalent work experience.\nSpecific coursework or experience in web development and experience with web\ntechnologies.\nFive (5) or more years of experience in a progressively responsible position with web\ndevelopment and/or information systems is required with accelerated, exceptional\nperformance.\n\nExperience with the following technologies and tools:\n\n•  Strong proficiency in at least one major development language:\n\nJava/ASP.NET/C/Python\n•  Experience with Selenium\n•  Knowledge of test methodologies, writing test plans, creating test cases and\n\ndebugging.\n\n•  Deep knowledge of internet technologies.\n\n\fUW HEALTH POSITION DESCRIPTION\n\nPreferred\n\nExperience with the following tools and technologies are desired:\n\nJava\n\nTemplate engineering (Handlebars/Mustache)\n\n•\n•  RequireJS/AMD\n•  Engineering techniques (SVN/Git, staging, continuous integration, etc)\n•\n•  MySQL/MS SQL Server\n•  Apache, Tomcat, Groovy, Grails\n•  CSS preprocessors (SASS/LESS)\n•\nIDE (IntelliJ IDEA, MyEclipse, etc)\n•  Gradle\n•  Maven\n•  MVC application frameworks like Spring\n•  Agile development techniques\n•  Google Analytics\n\nLicenses &\nCertifications\n\nMinimum\nPreferred\n\nRequired Skills, Knowledge, and Abilities\n\n•  Good technical skills, including knowledge of web technologies.\n•  Understanding of browser rendering and compatibility issues.\n•  Ability to work independently and be results-oriented.\n•  Ability to prioritize projects and react to critical deadlines.\n•  Creative approach and solutions to problems related to web development;\n\nprior experience in the field with demonstrated successful projects.\n\n•  Ability to analyze and identify problems, and develop innovative solutions.\n•  Effective communication, problem-solving and organizational abilities in both\n\nwritten and verbal form.\n\n•  Effective interpersonal skills, including the ability to promote teamwork and\n\nensure a high degree of internal and external customer satisfaction.\n\n•  Ability to manage multiple tasks with ease and efficiency.\n•  Ability to interact with and work around people\n•  Ability to make judgments in demanding situations\n•  Ability to react to frequent changes in duties and volume of work\n•  Effective communication skills\n•  Ability to listen empathetically\n•  Ability to logically organize details\n•  Comfortable accepting responsibility for medium to large scale projects\n\ninvolving multiple resources and spanning many months from start to finish\n\n•  Ability to manage multiple concurrent activities\n\nPHYSICAL REQUIREMENTS\n\nIndicate the appropriate physical requirements of this job in the course of a shift.  Note: reasonable\naccommodations may be made available for individuals with disabilities to perform the essential functions of this position.\nPhysical Demand Level\n\nOccasional\nUp to 33% of the time\n\nFrequent\n34%-66% of the time\n\nConstant\n67%-100% of the time\n\nx\n\nSedentary: Ability to lift up to 10 pounds\nmaximum and occasionally lifting and/or\ncarrying such articles as dockets, ledgers\nand small tools.  Although a sedentary job is\ndefined as one, which involves sitting, a\ncertain amount of walking and standing is\noften necessary in carrying out job duties.\nJobs are sedentary if walking and standing\nare required only occasionally and other\nsedentary criteria are met.\nLight: Ability to lift up to 20 pounds\nmaximum with frequent lifting and/or carrying\nof objects weighing up to 10 pounds.  Even\nthough the weight lifted may only be a\nnegligible amount, a job is in this category\nwhen it requires walking or standing to a\nsignificant degree.\nMedium: Ability to lift up to 50 pounds\nmaximum with frequent lifting/and or carrying\n\nUp to 10#\n\nNegligible\n\nNegligible\n\nUp to 20#\n\nUp to 10#  or requires\nsignificant walking or\nstanding, or requires\npushing/pulling of arm/leg\ncontrols\n\nNegligible or constant\npush/pull of items of\nnegligible weight\n\n20-50#\n\n10-25#\n\nNegligible-10#\n\n\fUW HEALTH POSITION DESCRIPTION\n\nobjects weighing up to 25 pounds.\nHeavy: Ability to lift up to 100 pounds\nmaximum with frequent lifting and/or carrying\nobjects weighing up to 50 pounds.\nVery Heavy:  Ability to lift over 100\npounds with frequent lifting and/or carrying\nobjects weighing over 50 pounds.\nList any other physical requirements or\nbona fide occupational qualifications:\n\n50-100#\n\n25-50#\n\n10-20#\n\nOver 100#\n\nOver 50#\n\nOver 20#\n\n•\n\nWork/Environmental: Moderate noise level consistent with an office environment\n\nNote:\n\nThe purpose of this document is to describe the general nature and level of work performed by personnel so\nclassified; it is not intended to serve as an inclusive list of all responsibilities associated with this position.\n\n",
    "location": "",
    "created_at": "2025-04-16T20:16:43.598356"
  }
]