[
  {
    "user_id": "ff47ba92-8a06-4251-969a-f70a536fddb0",
    "name": "",
    "email": "",
    "resume_text": "Tihraqua Ahmed\nSenior Quality Assurance Engineer\nRiyadh, Saudi Arabia\n(cid:131) +966506124840 # tihraquamahdi@gmail.com (cid:239) linkedin.com/in/tihraqua/ (cid:128) tihraqua mahdi.dev §\ngithub.com/tihraqua\n\nSummary\nISTQB® certified Software Quality Assurance Engineer with 6+ years in fintech, telecom, government, and insurance,\nspecializing in API and regression testing. Expertise in test plans, Selenium Webdriver, and performance testing using\nJMETER. Proficient in Agile/Scrum methodologies, delivering high-quality software solutions across diverse industries.\nProfessional Experience\n\nCouncil of Health Insurance\nSenior Quality Assurance Engineer\n\nApr 2024 – Present\nRiyadh, Saudi Arabia\n\n– Developed and executed test plans and checklists, ensuring thorough coverage of QA activities. KeyWord: Test Plan\n– Performed functional, integration, regression, system, and cross-platform testing, identifying and resolving critical issues.\n\nKeyword: Regression testing\n\n– Participated in developing and maintaining Selenium Automation Frameworks in Java using TestNG, improving testing\n\nefficiency by 15%. KeyWord: Selenium\n\n– Collaborated closely with development and project teams to investigate, debug, and triage issues back to their root\n\ncause, utilizing diagnostic tools and problem-solving skills. KeyWord: Debugging\n\nZain Sudan\nApplications QA & Testing Specialist\n\nAug 2022 – May 2024\nKhartoum, Sudan\n\n– Spearheaded the development and execution of manual and automated testing strategies for IT applications and digital\n\nservices, increasing user satisfaction by 20%. KeyWord: Test automation\n\n– Orchestrated test design and implemented risk-based testing methodologies to proactively identify potential issues,\n\nreducing critical defects by 25%. KeyWord: Risk-based Testing\n\n– Played a pivotal role in conducting performance testing using JMETER to ensure application and e-services performance\n\naligned with expectations, handling up to 10,000 concurrent users. KeyWord: Performance testing\n\n– Actively participated in the strategic upgrade of application releases, contributing to maintaining business systems and\n\nmitigating risks of operational disruptions. KeyWord: Application release\n\n– Developed and enforced a dynamic quality plan aligning system quality with requirements, enhancing overall compliance\n\nand performance standards. KeyWord: Quality assurance\n\n– Ensured that existing services remained unaffected by the introduction of new services and products, maintaining\n\noperational continuity and customer satisfaction. KeyWord: Service continuity\n\n– Applied advanced quality engineering principles throughout the Agile product lifecycle, elevating product standards and\n\nefficiency. KeyWord: Agile\n\n– Conducted detailed post-release testing, providing critical feedback for continuous improvement and reducing post-release\n\ndefects by 18%. KeyWord: Post-release testing\n\nElectronic Banking Services Co. EBS\nQuality Assurance Engineer II\n\nAug 2021 – Aug 2022\nKhartoum, Sudan\n\n– Masterminded and executed a comprehensive test strategy encompassing test plans, scenarios, and cases derived from\nproduct and software requirements, ensuring thorough coverage and product integrity, covering 100% requirements.\nKeyWord: Test Strategy\n\n– Reviewed and refined test cases and reports generated by junior engineers, fostering team skill development and ensuring\n\nhigh-quality outputs, improving team performance by 15%. KeyWord: Test cases\n\n– Facilitated certification processes and coordinated seamlessly with vendors and various departments, enhancing\n\ncross-functional collaboration, reducing certification time by 10%. KeyWord: Certification process\n\n– Ensured that applications adhered to software quality, security, and payment industry standards, upholding the\n\ncompany’s reputation for excellence. KeyWord: Software quality\n\n– Played a key role in planning core system upgrades, including scrutinizing release documents, refining test cases, and\n\noverseeing execution, ensuring seamless integration and functionality. KeyWord: System Upgrade\n\n– Initiated and implemented process improvements and introduced tools to streamline workflows, boosting team\n\nproductivity and effectiveness by 20%. KeyWord: Process improvement\n\n– Engaged in knowledge transfer activities, mentoring junior staff and promoting a culture of continuous learning and\n\nimprovement. KeyWord: Mentoring\n\n\fElectronic Banking Services Co. EBS\nQuality Assurance Engineer\n\nFeb 2020 – Feb 2021\nKhartoum, Sudan\n\n– Executed meticulously crafted test cases to identify and report software anomalies, contributing to the development of\n\nrobust and reliable software solutions, reducing defect rate by 12%. KeyWord: Test execution\n\n– Developed test cases from product and software requirements under senior supervision, ensuring comprehensive coverage\n\nand alignment with project objectives. KeyWord: Test development\n\n– Ensured strict compliance of developed applications with established software quality standards, reinforcing the\n\ncompany’s commitment to excellence. KeyWord: Compliance\n\n– Conducted thorough reviews of product documentation, including software installation, configuration guides, and user\n\nmanuals, ensuring accuracy and user-friendliness. KeyWord: Documentation\n\n– Assessed new product release documents, providing insightful feedback for continuous product enhancement. KeyWord:\n\nProduct release\n\n– Involved in core system upgrades, including review release documents, updating test cases and executing test cases.\n\nKeyWord: system upgrade\n\nElectronic Banking Services Co. EBS\nApplications Technical Support Engineer\n\nFeb 2019 – Feb 2020\nKhartoum, Sudan\n– Managed and maintained vital product support and maintenance contracts with clients, ensuring high levels of customer\n\nsatisfaction and retention, achieving 95% retention rate. KeyWord: Product support\n\n– Delivered first-level application support, adeptly resolving user issues and enhancing overall system usability and\n\nreliability. KeyWord: Application support\n\n– Ensured prompt resolution of problem and root cause tickets in accordance with Service Level Agreements, maintaining\n\nhigh standards of service delivery. KeyWord: SLA\n\n– Collaborated with cross-functional teams to maintain operational efficiency and consistency, contributing to successful\n\napplication implementations. KeyWord: Cross-functional collaboration\n\n– Took ownership of complex technical issues, demonstrating problem-solving prowess and commitment to customer\n\nsuccess. KeyWord: Problem-solving\n\n– Created and maintained functional design documents and other essential user resources, simplifying application usage\n\nand enhancing user experience. KeyWord: Documentation\n\nJan 2017 – Jan 2018\nKhartoum, Sudan\n\nJan 2010 – Jan 2015\nKhartoum, Sudan\n\nEducation\n\nUniversity of Khartoum\nMSc. Master of Science, Industrial and Computational Mathematics\n\nUniversity of Khartoum\nBSc. Bachelor of Science, Mathematics and Computer Science\n\nSkills\n\nTechnical Skills\nSelenium Webdriver (Expert) — Appium (Proficient) — JMeter (Expert) — Java\n(Proficient) — SQL (Proficient) — API Testing (Expert) — Regression Testing (Expert)\n— Test Planning (Expert) — Test Scripting (Expert) — JIRA (Expert) — TFS\n(Proficient) — Postman (Expert) — RestClient (Proficient) — SOAPUI (Proficient) —\nPlaywright (Proficient) — CI/CD (Intermediate)\nSoft Skills\nTroubleshooting — Problem Solving — Leadership — Tests Design — Teamwork —\nCommunication — Analytical Skills — Agile Methodologies — Scrum Methodologies\n\nCertifications\nISTQB® - FL Certificate\n\nISTQB® - Mobile Application Tester Certificate\n\nLanguages\n\nEnglish\nNative\n\nArabic\nNative\n\n",
    "profile_url": "",
    "created_at": "2025-04-16T20:16:43.571570"
  }
]